app/controllers/products_controller.rb

  def create
    @product = current_manager.products.new(product_params)
    if @product.save
---
INSERT INTO "products" ("name", "amount", "created_at", "updated_at", "manager_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "First"], ["amount", 125], ["created_at", "2017-11-01 12:12:11.437379"], ["updated_at", "2017-11-01 12:12:11.437379"], ["manager_id", 1]]